code = input('학번을 입력하세요: ')
name = input('이름을 입력하세요: ')
kor = int(input('국어 점수를 입력하세요: '))
eng = int(input('영어 점수를 입력하세요: '))
math = int(input('수학 점수를 입력하세요: '))

hap = kor + eng + math
avg = hap / 3

print('%20s %s %-20s' %('***', '성적표', '***'))
print('=================================================')
print('학번    이름    국어    영어    수학    총점    평균')
print('=================================================')
print('%s  %s  %4d   %4d   %4d    %4d    %4.2f' %(code, name, kor, eng, math, hap, avg))
print('=================================================')